import Counter from "../components/Counter";
import SubmitBtn from "../components/SubmitBtn";

export default function SingleProductPage() {
  return (
    <div className="grid grid-cols-2 gap-8">
      <div>
        <img src="../../public/product_image_1.png" alt="" />
        <img src="../../public/product_image_2.png" alt="" />
      </div>
      <div className="space-y-4">
        <h1 className="font-semibold text-2xl">BioBizz Acti Vera</h1>
        <p>
          Brand: <span className="text-green-600">BioBizz</span>
        </p>
        <div className="bg-[#FAFAFA] w-full p-4">
          <p className="text-[#878787] text-3xl font-medium">฿1,989</p>
        </div>
        <div>
          <p>
            เมื่อพืชช่วยพืชอย่างเป็นธรรมชาติ
            สรรพคุณของสมุนไพรจะถูกเสริมให้ไปถึงขั้นสูงสุด
            <br /> <br />
            ว่านหางจระเข้เป็นหัวใจสำคัญของ ไบโอบิซ แอคทิเวร่า
            ซึ่งเป็นสารกระตุ้นเกษตรอินทรีย์ที่ถูกออกแบบมาเพื่อปกป้องระบบภูมิคุ้มกัน
            เพิ่มการเผาผลาญ และเพิ่มการดูดซึมสารอาหาร แอคทิเวร่า
            ช่วยสลายน้ำตาลในดิน เลี้ยงจุลินทรีย์ในดิน ส่งเสริมการย่อยสลาย
            เร่งการเจริญเติบโตของพืช และเพิ่มการสังเคราะห์ด้วยแสง
            ส่วนประกอบมาจากพืช 100% <br /> <br />
            แอคทิเวร่า สามา รถใช้กับพืชได้หลายชนิด โดยเฉพาะสมุนไพร
            ใช้ได้ทั้งในช่วงการเจริญเติบโตและระยะออกดอก
            ช่วยกระตุ้นการเจริญเติบโตและการออกดอก
            ทำให้พืชแข็งแรงและมีสุขภาพดีทั้งภายในและภายนอก <br /> <br />
            ไบโอบิซ เป็นผลิตภัณฑ์ออร์แกนิก 100%
            เป็นมิตรกับสิ่งแวดล้อมและใช้งานง่าย ความลับที่ทำให้ผลิตภัณฑ์ของ
            ไบโอบิซ ดีกว่าปุ๋ยหมักอินทรีย์ทั่วไปคือส่วนผสมของน้ำวีนาส
            ซึ่งเป็นสารสกัดผักการฝรั่ง 100% จากเนเธอร์แลนด์
            โดยสูตรที่เราใช้ส่วนใหญ่จะประกอบไปด้วยกากน้ำตาล
            น้ำวีนาสจะทำการกระตุ้นการทำงานของแบคทีเรียที่ดีกับพืชในสารตั้งต้นตามธรรมชาติ
            เพิ่มการเจริญเติบโตและความมีชีวิตชีวาของพืชโดยไม่ต้องใช้สารเคมีสังเคราะห์หรือสารเติมแต่ง
            <br /> <br />
            วิธีการธรรมชาติที่เราใช้ในการให้พืชเสริมสร้างพืช
            จะช่วยสร้างผลผลิตที่มีคุณภาพมากกว่าผลิตภัณฑ์ปุ๋ยอินทรีย์ทั่วไป
            แอคทิเวร่า แตกต่างอย่างไร? ความแตกต่างที่สำคัญที่สุดระหว่างผลิตภัณฑ์
            ไบโอบิซ อื่นๆ ของเราที่มีส่วนประกอบจากพื้นดินหรือทะเล แอคทิเวร่า
            นั้นทำจากพืชเพื่อเพิ่มคุณค่าให้กับพืช <br /> <br />
            ทำไมต้องใช้ แอคทิเวร่า? <br /> <br />
            แอคทิเวร่า ทำให้พืชแข็งแรงและมีสุขภาพดีทั้งภายในและภายนอก
            ช่วยปกป้องและกระตุ้นระบบภูมิคุ้มกัน เพิ่มการงอกและการเผาผลาญของพืช
            สลายน้ำตาลและเพิ่มการดูดซึมสารอาหาร
            เป็นผลิตภัณฑ์ที่สร้างจากธรรมชาติที่ให้ผลเกือบเหนือธรรมชาติ
            และทำมาจากพืช 100% พืชชนิดใดเหมาะกับ แอคทิเวร่า? แอคทิเวร่า
            มีความหลากหลายมาก สามารถใช้ได้ทั้งการปลูกในร่มและกลางแจ้ง
            ใช้กับพืชอาหาร ใช้ในไร่ ใช้กับไม้ยืนต้น และไม้ประดับ
            ได้ในช่วงระยะการเจริญเติบโตและการออกดอก
            เพื่อกระตุ้นการเจริญเติบโตและการออกดอก <br /> <br />
            แอคทิเวร่าใช้ยังไง? <br /> <br />
            1. ผสม - ผสม แอคทิเวร่า ลงในแท้งค์น้ำหรือภาชนะแล้วคนให้เข้ากับน้ำ
            <br />
            2. เติมสารอาหาร - เพิ่มสารอาหาร ไบโอบิซ ที่เหมาะกับพืช และผสม
            แอคทิเวร่า ตามเข้าไป
            สามารถเพิ่มอาหารเสริมอื่นๆเข้าไปด้วยได้ตามความเหมาะสม <br />
            3. ปรับระดับกรด-ด่าง - ปรับระดับกรด-ด่าง ตามความจำเป็น <br />
            4. ใช้ปริมาณที่ถูกต้อง - เราแนะนำให้ใช้ แอคทิเวร่า ปริมาณ 5 มล.
            ต่อน้ำ 1 ลิตร สำหรับรดน้ำจากกระป๋อง หรือ 1-2 มล.
            ต่อน้ำหนึ่งลิตรเพื่อสเปรย์ทางใบ
          </p>
        </div>
        <div className="flex gap-4">
          <Counter />
          <p className="text-green-500"> 21 IN STOCK</p>
        </div>
        <SubmitBtn className=" w-6/12">เพิ่มไปยังรถเข็น</SubmitBtn>
        <p>
          รหัสสินค้า: <span>BBAV</span>
        </p>
        <p>
          หมวดหมู่: <span>ปุ๋ยออแกร์นิค</span>
        </p>
      </div>
    </div>
  );
}
